Repository: tkachenko24/consumption_fuel_calculator
Catalog: assets/localization/l10n/intl_*.arb
Languages: uk

# hi_word
source: Hello World
uk: Привіт Світ

# app_name
source: Vehicle Consumption Calculator
uk: Калькулятор витрати автомобіля

source: Volume,
uk: Обʼєм,

source: Capacity,
uk: Місткість,

# litres
source: l.
uk: л.

# gallons
source: g.
uk: г.

source: Price
uk: Ціна

source: Distance,
uk: Пробіг,

# kilometers
source: km.
uk: км.

# kilowatts
source: kW.
uk: кВ.

# miles
source: m.
uk: м.

source: Consumption
uk: Витрата

# price_per
source: P/{modeUnit}
uk: Ц/{modeUnit}

source: Date
uk: Дата

source: Delete
uk: Видалити

# metric_consumption
source: {modeUnit}/100km.
uk: {modeUnit}/100км.

# imperial_consumption
source: mp{modeUnit}
uk: мн{modeUnit}

# units_tooltip
source: Switch units
uk: Змінити одиниці виміру

# language_tooltip
source: Switch language
uk: Змінити мову

# info_tooltip
source: App info
uk: Довідка

# theme_tooltip
source: Switch theme
uk: Змінити тему

# mode_tooltip
source: Switch mode
uk: Змінити режим

# save_tooltip
source: Save data
uk: Зберегти данні

# list_tooltip
source: Consumption history
uk: Історія витрат палива

# currency_tooltip
source: Switch currency
uk: Змінити валюту

# back_tooltip
source: Back
uk: Назад

# about_title
source: What can this app do?
uk: Що може цей застосунок?

# about_description
source: It is designed to help you keep track of your vehicle's fuel/electricity consumption, such as: consumption per local distance unit and price per kilometer.
uk: Він призваний допомогти вам вести чіткий розрахунок витрат палива/електроенергії вашого автомобіля, таких як: витрата на локальну одиницю відстані, та ціну одного кілометра

# usage_title
source: How to use it?
uk: Як ним коритсуватися?

# usage_description
source: Simply enter the 3 parameters in the numeric fields: 1. The amount of fuel/electricity consumed by your vehicle since the last refueling/charging; 2. The price of the consumed fuel type; 3. The distance traveled by your vehicle since the last refueling/charging. Once you have entered all the data and the indicators have changed their color, you can save your data.
uk: Просто введіть в цифрові поля 3 параметра: 1. Обʼєм палива/електроенергії який витратив ваш транспортний засіб з моменту останньої заправки/зарядки; 2. Ціну спожитого виду палива; 3. Пробіг який здолав ваш транспортний засіб з моменту останньої заправки/зарядки; Після того як ви ввли всі данні, та індикатори змінили свій колір ви можете зберегти ваші данні.

# buttons_title
source: What do the other buttons do?
uk: Що роблять інші кнопки?

# buttons_description
source: Press and find out! But in short: (from left to right) 1. Switches the theme (light, dark, system); 2. Switches the mode from ICE to Electric; 3. Switches the units from metric to imperial.
uk: Настисніть дізнаєтесь) Але якщо коротко то: (зліва направо) 1. Змінює тему (світла, темна, системна); 2. Змінює режим з ДВЗ на Електро; 3. Змінює одиниці виміру з метричних на імперські

# data_title
source: How to view saved data?
uk: Як переглянути збереженні данні?

# data_description
source: Tap the rightmost button on the bottom navigation bar to open a list of your data, assuming you have saved it there. You can also delete incorrect or unwanted records here.
uk: Натисність крайню праву кнопку на нижній навігаційній панелі, відкриєтся список з вашими данними, звісно якщо ви їх перед цим туди зберігли. Тут же ви можете видалити помилкові, або небажані записи

# bye_word
source: Goodbye World
uk: Прощавай Світ
